app/views/ratings/index.html.erb

        <td> <%= link_to user.favorite_brewery.name, user.favorite_brewery%></td>
        <td><%= user.ratings.count%></td>
---
SELECT "ratings".* FROM "ratings"
SELECT COUNT(*) FROM "ratings"