app/views/styles/show.html.erb

SELECT "beers".* FROM "beers" WHERE "beers"."style_id" = ?  [["style_id", 8]]
---
<ul>
  <% @style.beers.each do |b|%>