app/controllers/memberships_controller.rb

  def index
    @memberships = Membership.all
---
SELECT "memberships".* FROM "memberships"

  def new
    @membership = Membership.new
    @clubs = BeerClub.all.reject{ |b| b.members.include? current_user }
---
SELECT "beer_clubs".* FROM "beer_clubs"

  def create
    @membership = Membership.new(membership_params)
    @membership.user = current_user

    respond_to do |format|
      if @membership.save
        format.html { redirect_to @membership.beer_club, notice: "#{current_user.username}, welcome to the club!" }
        format.json { render action: 'show', status: :created, location: @membership }

      else
        @clubs = BeerClub.all.reject{ |b| b.members.include? current_user }
---
INSERT INTO "memberships" ("beer_club_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["beer_club_id", 1], ["created_at", Thu, 23 Jan 2014 00:18:20 UTC +00:00], ["updated_at", Thu, 23 Jan 2014 00:18:20 UTC +00:00], ["user_id", 3]]
SELECT "beer_clubs".* FROM "beer_clubs"

    def set_membership
      @membership = Membership.find(params[:id])
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."id" = ? LIMIT 1  [["id", "2"]]