app/controllers/styles_controller.rb

SELECT "styles".* FROM "styles"
---
  def index
    @styles = Style.all

SELECT "styles".* FROM "styles" WHERE "styles"."id" = ? LIMIT 1  [["id", "7"]]
---
  def set_style
    @style = Style.find(params[:id])

UPDATE "styles" SET "description" = ?, "updated_at" = ? WHERE "styles"."id" = 7  [["description", "HerQ"], ["updated_at", Sun, 16 Feb 2014 21:29:20 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @style.update(style_params)